# Write a Pandas program to split a dataset, group by one column and get mean, min, and max values by group. Using the following dataset find the mean, min, and max values of purchase amount (purch_amt) group by customer id (customer_id).

In [12]:
import pandas as pd

In [13]:
df=pd.DataFrame({'school': ['s001','s002','s003','s001'],'class': ['V', 'V', 'VI', 'VI'],'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton'],'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998'],'age': [12, 12, 13, 13],'height': [173, 192, 186, 167],'weight': [35, 32, 33, 30],'address': ['street1', 'street2', 'street3', 'street1']},index=['S1', 'S2', 'S3', 'S4'])

In [14]:
df

   school class            name date_Of_Birth   age  height  weight  address
S1   s001     V  Alberto Franco     15/05/2002   12     173      35  street1
S2   s002     V    Gino Mcneill     17/05/2002   12     192      32  street2
S3   s003    VI     Ryan Parkes     16/02/1999   13     186      33  street3
S4   s001    VI    Eesha Hinton     25/09/1998   13     167      30  street1

In [15]:
df1 = df.groupby('school').agg({'age': ['mean', 'min', 'max']})

In [16]:
df1

         age
        mean min max
school
s001    12.5  12  13
s002    12.0  12  12
s003    13.0  13  13